configuration/Enums/Статус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Статус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квалифицированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Catalogs/Лиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Лиды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Источник</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопалВСтатус</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/HTTPServices/CRM/Ext/Module.bsl
&НаСервере
Функция LeadsПолучитьЛиды(Запрос)
		
 Ответ = Новый HTTPСервисОтвет(200);
 Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
 
 УстановитьПривилегированныйРежим(Истина);
 
 // получаем параметр статуса
 ЗначениеСтатуса = Неопределено;
 
 //проверка на наличие параметра status
 СтатусПараметр = Строка(?(Запрос.ПараметрыЗапроса.Количество() <> 0, Запрос.ПараметрыЗапроса["status"], Null)); 

 Если ЗначениеЗаполнено(СтатусПараметр) Тогда	 
	 Попытка
		 ЗначениеСтатуса = Перечисления.Статус[СтатусПараметр];
	 Исключение
		 Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Некорректный статус")));
		 Возврат Ответ;
	 КонецПопытки;
 КонецЕсли;
	                                      	
 ЗапросЛиды = новый Запрос;
 ТекстЗапроса =	"ВЫБРАТЬ
	|	Лиды.Код КАК Код,
	|	Лиды.Имя КАК Имя,
	|	Лиды.Фамилия КАК Фамилия,
	|	Лиды.Телефон КАК Телефон,
	|	Лиды.Почта КАК Почта,
	|	Лиды.Статус.Порядок КАК СтатусПорядок,
	|	Лиды.Источник.Код КАК ИсточникКод,
	|	Лиды.Источник.Наименование КАК ИсточникНаименование,
	|	Лиды.Менеджер.Код КАК МенеджерКод,
	|	Лиды.Менеджер.Имя КАК МенеджерИмя,
	|	Лиды.Менеджер.Фамилия КАК МенеджерФамилия,
	|	Лиды.Менеджер.Роль.Порядок КАК МенеджерРольПорядок,
	|	Лиды.Создан КАК Создан,
	|	Лиды.ПопалВСтатус КАК ПопалВСтатус
	|ИЗ
	|	Справочник.Лиды КАК Лиды";         
                              
 Если ЗначениеЗаполнено(СтатусПараметр) Тогда
	 ТекстЗапроса = ТекстЗапроса +	 "
	 |ГДЕ	 |	Лиды.Статус = &Статус";
 КонецЕсли;
 
 ЗапросЛиды.Текст = ТекстЗапроса;
 
 Если ЗначениеЗаполнено(СтатусПараметр) Тогда
	 ЗапросЛиды.УстановитьПараметр("Статус", ЗначениеСтатуса);
 КонецЕсли;
 
 Попытка 	Выборка = ЗапросЛиды.Выполнить().Выбрать(); Исключение 	Ответ.УстановитьТелоИзСтроки("Ошибка запроса, ка: " + ОписаниеОшибки());	Возврат Ответ; КонецПопытки;
  
 Лиды = новый Массив;

 Пока Выборка.Следующий() Цикл
	 
 	Лид = Новый Структура;
	
	Лид.Вставить("leadId", Выборка.Код);
 	Лид.Вставить("name", Выборка.Имя);
 	Лид.Вставить("lastname", Выборка.Фамилия);
 	Лид.Вставить("phoneNumber", Выборка.Телефон);
	Лид.Вставить("mail", Выборка.Почта);
	
	// перечисление статуса в строку
	Если Строка(Выборка.СтатусПорядок) = "0" Тогда
		Лид.Вставить("status", "Новый");
	ИначеЕсли Строка(Выборка.СтатусПорядок) = "1" Тогда
		Лид.Вставить("status", "Квалифицированный");
	ИначеЕсли Строка(Выборка.СтатусПорядок) = "2" Тогда
		Лид.Вставить("status", "Предложение");
	ИначеЕсли Строка(Выборка.СтатусПорядок) = "3" Тогда
		Лид.Вставить("status", "Успешно");
	ИначеЕсли Строка(Выборка.СтатусПорядок) = "4" Тогда
		Лид.Вставить("status", "Отказ");
	КонецЕсли;
	
	// перечисление источника и менеджера
	Лид.Вставить("sourceId", Строка(?(ЗначениеЗаполнено(Выборка.ИсточникКод), Выборка.ИсточникКод, "")));
	
	Лид.Вставить("managerId", Строка(?(ЗначениеЗаполнено(Выборка.МенеджерКод), Выборка.МенеджерКод, "")));
	
	// даты
	Лид.Вставить("createdAt", Строка(Формат(Выборка.Создан, "ДФ=yyyy-MM-dd HH:mm:ss")));
	Лид.Вставить("enteredAt", Строка(Формат(Выборка.ПопалВСтатус, "ДФ=yyyy-MM-dd HH:mm:ss")));	
	
 	Лиды.Добавить(Лид); 
 КонецЦикла; 
  
 Результат = Новый Структура;
 Результат.Вставить("success", Истина);
 Результат.Вставить("data", Лиды);
 
 Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Результат));
 Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
 
 УстановитьПривилегированныйРежим(Ложь);
 Возврат Ответ
  
КонецФункции

&НаСервере
Функция LeadsСоздатьЛида(Запрос)    Ответ = Новый HTTPСервисОтвет(201);    Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");    УстановитьПривилегированныйРежим(Истина);    Тело = Запрос.ПолучитьТелоКакСтроку();    Если ПустаяСтрока(Тело) Тогда        Ответ.КодСостояния = 400;        Ответ.УстановитьТелоИзСтроки(            ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Пустое тело запроса")));        Возврат Ответ;    КонецЕсли;    Попытка        Чтение = Новый ЧтениеJSON;        Чтение.УстановитьСтроку(Тело);        Данные = ПрочитатьJSON(Чтение);        Чтение.Закрыть();    Исключение        Ответ.КодСостояния = 400;        Ответ.УстановитьТелоИзСтроки(            ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Невалидный JSON")));        Возврат Ответ;    КонецПопытки;    МаппингСтатусов = Новый Соответствие;    МаппингСтатусов.Вставить("new",          Перечисления.Статус.Новый);    МаппингСтатусов.Вставить("qualified", Перечисления.Статус.Квалифицированный);    МаппингСтатусов.Вставить("proposal",     Перечисления.Статус.Предложение);    МаппингСтатусов.Вставить("won",      Перечисления.Статус.Успешно);    МаппингСтатусов.Вставить("lost",     Перечисления.Статус.Отказ);     Имя = Данные["firstname"];    Телефон = Данные["phoneNumber"];    Если НЕ ЗначениеЗаполнено(Имя) Тогда        Ответ.КодСостояния = 400;        Ответ.УстановитьТелоИзСтроки(            ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Не указано имя (поле firstname)")));        Возврат Ответ;    КонецЕсли;    Если НЕ ЗначениеЗаполнено(Телефон) Тогда        Ответ.КодСостояния = 400;        Ответ.УстановитьТелоИзСтроки(            ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Не указан телефон (поле phoneNumber)")));        Возврат Ответ;    КонецЕсли;    Лид = Справочники.Лиды.СоздатьЭлемент();    Лид.Имя     = Имя;    Лид.Фамилия = ?(Данные["lastname"] <> Неопределено, Данные["lastname"], "");    Лид.Телефон  = Телефон;    Лид.Почта    = ?(Данные["email"] <> Неопределено, Данные["email"], "");    Если Данные["status"] <> Неопределено Тогда        НайденныйСтатус = МаппингСтатусов[Данные["status"]];        Если НайденныйСтатус = Неопределено Тогда            Ответ.КодСостояния = 400;            Ответ.УстановитьТелоИзСтроки(                ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь,                    "Некорректный статус: " + Данные["status"])));            Возврат Ответ;        КонецЕсли;        Лид.Статус = НайденныйСтатус;    Иначе        Лид.Статус = Перечисления.Статус.Новый;    КонецЕсли;    Если Данные["sourceId"] <> Неопределено Тогда        НайденныйИсточник = Справочники.Источник.НайтиПоКоду(Данные["sourceId"]);        Если НЕ ЗначениеЗаполнено(НайденныйИсточник) Тогда            Ответ.КодСостояния = 400;            Ответ.УстановитьТелоИзСтроки(                ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь,                    "Источник не найден по коду: " + Данные["sourceId"])));            Возврат Ответ;        КонецЕсли;        Лид.Источник = НайденныйИсточник;    КонецЕсли;    Если Данные["managerId"] <> Неопределено Тогда        НайденныйМенеджер = Справочники.Менеджеры.НайтиПоКоду(Данные["managerId"]);        Если НЕ ЗначениеЗаполнено(НайденныйМенеджер) Тогда            Ответ.КодСостояния = 400;            Ответ.УстановитьТелоИзСтроки(                ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь,                    "Менеджер не найден по коду: " + Данные["managerId"])));            Возврат Ответ;        КонецЕсли;        Лид.Менеджер = НайденныйМенеджер;	КонецЕсли;                             
	    Попытка        Лид.Записать();    Исключение        Ответ.КодСостояния = 500;        Ответ.УстановитьТелоИзСтроки(            ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь,                "Ошибка записи: " + ОписаниеОшибки())));        Возврат Ответ;    КонецПопытки;    ДанныеОтвета = Новый Структура;    ДанныеОтвета.Вставить("leadId", Лид.Код);    ДанныеОтвета.Вставить("firstname", Лид.Имя);    ДанныеОтвета.Вставить("lastname", Лид.Фамилия);    ДанныеОтвета.Вставить("phoneNumber", Лид.Телефон);    ДанныеОтвета.Вставить("email", Лид.Почта);    ДанныеОтвета.Вставить("status", Данные["status"]);    ДанныеОтвета.Вставить("sourceId", ?(Данные["sourceId"] <> Неопределено, Данные["sourceId"], ""));    ДанныеОтвета.Вставить("managerId", ?(Данные["managerId"] <> Неопределено, Данные["managerId"], ""));    ДанныеОтвета.Вставить("createdAt", Строка(Формат(Лид.Создан, "ДФ=yyyy-MM-dd HH:mm:ss"))); 
	ДанныеОтвета.Вставить("enteredAt", Строка(Формат(Лид.ПопалВСтатус, "ДФ=yyyy-MM-dd HH:mm:ss")));    Результат = Новый Структура;    Результат.Вставить("success", Истина);    Результат.Вставить("data", ДанныеОтвета);    Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Результат));    Возврат Ответ;КонецФункции      
                            
&НаСервере
Функция ИзменитьСтатусЛида(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдЛида = Запрос.ПараметрыURL["leadId"];
	
	Если НЕ ЗначениеЗаполнено(ИдЛида) Тогда
		Ответ.КодСостояния = 400;
		Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Не указан идентификатор лида")));
		Возврат Ответ;
	КонецЕсли;	
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
		ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		Ответ.КодСостояния = 400;
		Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Некорректный JSON в теле запроса")));
		Возврат Ответ;
	КонецПопытки;
	
	НовыйСтатусСтрока = Неопределено;
	
	Если ТипЗнч(ДанныеЗапроса) = Тип("Соответствие") Тогда
		НовыйСтатусСтрока = ДанныеЗапроса["status"];
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НовыйСтатусСтрока) Тогда
		Ответ.КодСостояния = 400;
		Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Отсутствует поле нового статус (status)")));
		Возврат Ответ;
	КонецЕсли;
	
	Попытка
		НовыйСтатус = Перечисления.Статус[НовыйСтатусСтрока];
	Исключение
		Ответ.КодСостояния = 400;
		Ответ.УтсановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Некорректный статус: " + НовыйСтатусСтрока)));
		Возврат Ответ
	КонецПопытки;
	
	ЗапросИзменениеСтатусаЛида = Новый Запрос;
	ЗапросИзменениеСтатусаЛида.Текст =
	"ВЫБРАТЬ
	| Лиды.Ссылка КАК Ссылка
	|Из
	| Справочник.Лиды КАК Лиды
	|ГДЕ
	| Лиды.Код = &Код";
	ЗапросИзменениеСтатусаЛида.УстановитьПараметр("Код", ИдЛида);
	
	Результат = ЗапросИзменениеСтатусаЛида.Выполнить();
	
	Если Результат.Пустой() Тогда
		Ответ.КодСостояния = 404;
		Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Лид с таким кодом не найден")));
		Возврат Ответ;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Попытка
		ЛидОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЛидОбъект.Статус = НовыйСтатус;
		ЛидОбъект.Записать();    Исключение        Ответ.КодСостояния = 500;        Ответ.УстановитьТелоИзСтроки(            ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Ошибка записи: " + ОписаниеОшибки())));        Возврат Ответ;	КонецПопытки;
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("leadId", ИдЛида);
	ДанныеОтвета.Вставить("status", НовыйСтатусСтрока);
	ДанныеОтвета.Вставить("enteredAt", Строка(Формат(ЛидОбъект.ПопалВСтатус, "ДФ=yyyy-mm-dd HH:mm:ss")));  
	
	Результат = Новый Структура;
	Результат.Вставить("success", Истина); 
	Результат.Вставить("data", ДанныеОтвета);
	
	Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Результат));
	
	Возврат Ответ;
КонецФункции

&НаСервере
Функция ПолучитьJSONИзЗапроса(Объект) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON; 
 	ЗаписьJSON.УстановитьСтроку(); 
 	ЗаписатьJSON(ЗаписьJSON, Объект);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция TestPOSTМетод1(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Тело = Запрос.ПолучитьТелоКакСтроку();
	
	Если ПустаяСтрока(Тело) Тогда
		Ответ.КодСостояния = 400;
		Ответ.УстановитьТелоИзСтроки( "{" "error" ":" + Тело + "}" +
									  "{" "Content-lenght" ":" + Запрос.Заголовки.Получить("Content-length") + "}");
		Возврат Ответ
	Иначе
		Попытка
			Результат = Новый Структура;
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(Тело);
			Данные = ПрочитатьJSON(Чтение);
			Для каждого СтрокаМассива из Данные Цикл
				// ---
				// ЗДЕСЬ ДОЛЖНА БЫТЬ ВАЛИДАЦИЯ ДАННЫХ ИЗ ЗАПРОСА!!!!!!
				// ---
	
				Лид = Справочники.Лиды.СоздатьЭлемент();
				
				Лид.Имя = СтрокаМассива.Имя;
				Лид.Фамилия = ?(СтрокаМассива.Свойство("lastname"), СтрокаМассива.lastname, "");
				Лид.Телефон = СтрокаМассива.phoneNumber;
				
				Если СтрокаМассива.Свойство("status") Тогда
					Попытка
						Лид.Статус = Перечисления.Статус[СтрокаМассива.status];
					Исключение
						Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("status", Ложь, "Некорректный статус")));
						Возврат Ответ;
					КонецПопытки;
				КонецЕсли;
				
				Если СтрокаМассива.Свойство("sourceRef") Тогда
					Лид.Источник = Справочники.Источник.НайтиПоСсылке(Новый УникальныйИдентификатор(СтрокаМассива.sourceRef));
				КонецЕсли;
				
				//Если Данные.Свойство("managerRef") Тогда
				//	Лид.Менеджер = 
					
				Лид.Создан = ТекущаяДата();
				Лид.ПопалВСтатус = ТекущаяДата();
				
				
				Попытка
					Лид.Записать();
					Результат.Вставить("leadId", Лид.Код);
				Исключение
					Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("Записать() не выполнен.", Ложь, ОписаниеОшибки())));
					Возврат Ответ;
				КонецПопытки;
			КонецЦикла;
				
		Исключение
			Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("error", Ложь, "Невалидный JSON")));
			Возврат Ответ;
		КонецПопытки;
	КонецЕсли;
	
		
	Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Результат));
	
	УстановитьПривилегированныйРежим(Ложь);
	
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьЛидаПоИдентификатору(Запрос)  
	Ответ = Новый HTTPСервисОтвет(200);    Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдЛида = Запрос.ПараметрыURL["leadId"];  
	
	Если НЕ ЗначениеЗаполнено(ИдЛида) Тогда
		Ответ.КодСостояния = 400;
		Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Не указан идентификатор лида")));
		Возврат Ответ;
	КонецЕсли;	
	
	ЗапросЛид = Новый Запрос;
	ЗапросЛид.Текст = 
		"ВЫБРАТЬ
		| Лиды.Ссылка КАК Ссылка, 
		| Лиды.Код КАК Код,
		| Лиды.Наименование КАК Наименование,
		| Лиды.Телефон КАК Телефон,
		| Лиды.Почта КАК Почта,
		| Лиды.Статус КАК Статус,
		| Лиды.Источник.Код КАК ИсточникКод,
		| Лиды.Менеджер.Код КАК МенеджерКод,
		| Лиды.Создан КАК Создан,
		| Лиды.ПопалВСтатус КАК ПопалВСтатус
		|ИЗ
		| Справочник.Лиды КАК Лиды
		|ГДЕ
		| Лиды.Код = &Код";
	
	ЗапросЛид.УстановитьПараметр("Код", ИдЛида);
	
	Попытка
		Результат = ЗапросЛид.Выполнить();
	Исключение
		Ответ.КодСостояния = 500;
		Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Ошибка запроса: " + ОписаниеОшибки())));
		Возврат Ответ;
	КонецПопытки;
	
	Если Результат.Пустой() Тогда
		Ответ.КодСостояния = 404;
		Ответ.УстановитТелоИзСтроки(ПолучитьJSONИзЗапроса(Новый Структура("success, error", Ложь, "Лид не найден")));
		Возврат Ответ;
	КонецЕсли;	
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	МаппингСтатусов = Новый Соответствие;
	МаппингСтатусов.Вставить(Перечисления.Статус.Новый, "Новый");    МаппингСтатусов.Вставить(Перечисления.Статус.Квалифицированный, "Квалифицированный");    МаппингСтатусов.Вставить(Перечисления.Статус.Предложение, "Предложение");    МаппингСтатусов.Вставить(Перечисления.Статус.Успешно, "Успешно");    МаппингСтатусов.Вставить(Перечисления.Статус.Отказ, "Отказ"); 
	
	Лид = Новый Структура;
	Лид.Вставить("leadId", Выборка.Код);
	Лид.Вставить("firstname", Выборка.Имя);
	Лид.Вставить("lastname", Выборка.Фамилия);
	Лид.Вставить("phoneNumber", Выборка.Телефон);
	Лид.Вставить("email", Выборка.Почта);
	Лид.Вставить("status", МаппингСтатусов[Выборка.Статус]);
	Лид.Вставить("sourceId",  Строка(?(ЗначениеЗаполнено(Выборка.ИсточникКод), Выборка.ИсточникКод, "")));    Лид.Вставить("managerId", Строка(?(ЗначениеЗаполнено(Выборка.МенеджерКод), Выборка.МенеджерКод, ""))); 
	Лид.Вставить("createdAt", Строка(Формат(Выборка.Создан, "ДФ=yyyy-MM-dd HH:mm:ss")));    Лид.Вставить("enteredAt", Строка(Формат(Выборка.ПопалВСтатус, "ДФ=yyyy-MM-dd HH:mm:ss")));
	
	Результат = Новый Структура;
	Результат.Вставить("success", Истина);
	Результат.Вставить("data", Лид);
	
	Ответ.УстановитьТелоИзСтроки(ПолучитьJSONИзЗапроса(Результат));
	Возврат Ответ;
КонецФункции
